ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC55S69-McuLink-Pro/MCU-Link-Pro_Measurement/McuLib/src/McuArmTools.c
/* ###################################################################
**     This component module is generated by Processor Expert. Do not modify it.
**     Filename    : McuArmTools.h
**     Project     : FRDM-K64F_Generator
**     Processor   : MK64FN1M0VLL12
**     Component   : KinetisTools
**     Version     : Component 01.044, Driver 01.00, CPU db: 3.00.000
**     Compiler    : GNU C Compiler
**     Date/Time   : 2022-01-04, 17:37, # CodeGen: 773
**     Abstract    :
**
**     Settings    :
**          Component name                                 : McuArmTools
**          Utility                                        : McuUtility
**          SDK                                            : McuLib
**          Shell                                          : Enabled
**            Shell                                        : McuShell
**     Contents    :
**         SoftwareReset          - void McuArmTools_SoftwareReset(void);
**         UIDGet                 - uint8_t McuArmTools_UIDGet(McuArmTools_UID *uid);
**         UIDSame                - bool McuArmTools_UIDSame(const McuArmTools_UID *src, const McuArmTools_UID...
**         UIDtoString            - uint8_t McuArmTools_UIDtoString(const McuArmTools_UID *uid, uint8_t *buf,...
**         GetKinetisFamilyString - McuArmTools_ConstCharPtr McuArmTools_GetKinetisFamilyString(void);
**         GetPC                  - void* McuArmTools_GetPC(void);
**         GetSP                  - void* McuArmTools_GetSP(void);
**         SetPSP                 - void McuArmTools_SetPSP(void *setval);
**         SetLR                  - void McuArmTools_SetLR(uint32_t setval);
**         InitCycleCounter       - void McuArmTools_InitCycleCounter(void);
**         ResetCycleCounter      - void McuArmTools_ResetCycleCounter(void);
**         EnableCycleCounter     - void McuArmTools_EnableCycleCounter(void);
**         DisableCycleCounter    - void McuArmTools_DisableCycleCounter(void);
**         GetCycleCounter        - uint32_t McuArmTools_GetCycleCounter(void);
**         ParseCommand           - uint8_t McuArmTools_ParseCommand(const unsigned char* cmd, bool *handled,...
**         Deinit                 - void McuArmTools_Deinit(void);
**         Init                   - void McuArmTools_Init(void);
**
** * Copyright (c) 2014-2022, Erich Styger
**  * Web:         https://mcuoneclipse.com
**  * SourceForge: https://sourceforge.net/projects/mcuoneclipse
**  * Git:         https://github.com/ErichStyger/McuOnEclipse_PEx
**  * All rights reserved.
**  *
**  * Redistribution and use in source and binary forms, with or without modification,
**  * are permitted provided that the following conditions are met:
**  *
**  * - Redistributions of source code must retain the above copyright notice, this list
**  *   of conditions and the following disclaimer.
**  *
**  * - Redistributions in binary form must reproduce the above copyright notice, this
**  *   list of conditions and the following disclaimer in the documentation and/or
**  *   other materials provided with the distribution.
**  *
**  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
**  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
**  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
**  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
**  * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
**  * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
**  * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
**  * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
**  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
**  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
** ###################################################################*/
/*!
** @file McuArmTools.h
** @version 01.00
** @brief
**
*/         
/*!
**  @addtogroup McuArmTools_module McuArmTools module documentation
**  @{
*/         

/* MODULE McuArmTools. */

#include "McuArmTools.h"

#if McuLib_CONFIG_CPU_IS_ARM_CORTEX_M

#include "McuUtility.h" /* various utility functions */
#if McuLib_CONFIG_NXP_SDK_2_0_USED
  #include "fsl_common.h"
  #if McuLib_CONFIG_CPU_IS_KINETIS && !McuLib_CONFIG_IS_KINETIS_KE
    #include "fsl_sim.h" /* system integration module, used for CPU ID */
  #elif McuLib_CONFIG_CPU_IS_LPC && McuLib_CONFIG_CPU_IS_LPC55xx /* LPC55x */
    #include "fsl_iap.h" /* if missing, add this module from the MCUXpresso SDK */
    #include "fsl_iap_ffr.h"
  #elif McuLib_CONFIG_CPU_IS_LPC  /* LPC845 */
    #include "fsl_iap.h" /* if missing, add this module from the MCUXpresso SDK */
  #endif
#elif McuLib_CONFIG_SDK_VERSION_USED==McuLib_CONFIG_SDK_KINETIS_1_3
  #include "Cpu.h" /* include CPU related interfaces and defines */
#elif McuLib_CONFIG_SDK_VERSION_USED==McuLib_CONFIG_SDK_S32K
  #include "Cpu.h" /* include CPU related interfaces and defines */
#elif McuLib_CONFIG_CPU_IS_ARM_CORTEX_M
  /* include device specific header file for CMSIS inside "McuArmToolsconfig.h" */
#endif

#if McuLib_CONFIG_CPU_IS_KINETIS
#if McuLib_CONFIG_CORTEX_M==4
static const unsigned char *const KinetisM4FamilyStrings[] =
{ /* FAMID (3 bits) are used as index */
  (const unsigned char *)"K10 or K12 Family",          /* 000 */
  (const unsigned char *)"K20 or K22 Family",          /* 001 */
  (const unsigned char *)"K30, K11 or K61 Family",     /* 010 */
  (const unsigned char *)"K40 or K21 Family",          /* 011 */
  (const unsigned char *)"K60 or K62 Family",          /* 100 */
  (const unsigned char *)"K70 Family",                 /* 101 */
  (const unsigned char *)"Reserved",                   /* 110 */
  (const unsigned char *)"Reserved"                    /* 111 */
};
#endif

#if McuLib_CONFIG_CORTEX_M==0 && !McuLib_CONFIG_IS_KINETIS_KE
static const unsigned char *const KinetisM0FamilyStrings[] =
{ /* FAMID (3 bits) are used as index */
  (const unsigned char *)"KL0x",          /* 0000 */
  (const unsigned char *)"KL1x",          /* 0001 */
  (const unsigned char *)"KL2x",          /* 0010 */
  (const unsigned char *)"KL3x",          /* 0011 */
  (const unsigned char *)"KL4x",          /* 0100 */
  (const unsigned char *)"Reserved",      /* 0101 */
  (const unsigned char *)"Reserved",      /* 0110 */
  (const unsigned char *)"Reserved"       /* 0111 */
};
#endif
#endif

#if McuArmTools_CONFIG_PARSE_COMMAND_ENABLED
static uint8_t PrintStatus(const McuShell_StdIOType *io)
{
#if McuLib_CONFIG_CPU_IS_KINETIS || McuLib_CONFIG_CPU_IS_LPC
  uint8_t buf[1+(16*5)+1+1]; /* "{0xAA,...0xBB}" */
  uint8_t res;
  McuArmTools_UID uid;
#endif

  McuShell_SendStatusStr((unsigned char*)"McuArmTools", (unsigned char*)"Hardware status\r\n", io->stdOut);
#if McuLib_CONFIG_CPU_IS_KINETIS || McuLib_CONFIG_CPU_IS_LPC
  res = McuArmTools_UIDGet(&uid);
  if (res==ERR_OK) {
    res = McuArmTools_UIDtoString(&uid, buf, sizeof(buf));
  }
  if (res!=ERR_OK) {
    McuUtility_strcpy(buf, sizeof(buf), (unsigned char*)"ERROR");
  }
  McuShell_SendStatusStr((unsigned char*)"  UID", buf, io->stdOut);
  McuShell_SendStr((unsigned char*)"\r\n", io->stdOut);
#endif

