ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC55S69-McuLink-Pro/MCU-Link-Pro_Measurement/McuLib/src/McuArmTools.c
  res = IAP_ReadUniqueID((uint32_t*)&uid->id[0]);
  if (res != kStatus_IAP_Success) {
    return ERR_FAILED;
  }
  return ERR_OK;
#elif McuLib_CONFIG_CPU_IS_LPC && McuLib_CONFIG_CPU_VARIANT==McuLib_CONFIG_CPU_VARIANT_NXP_LPC55S16
  int i;
  uint8_t *p;

  /* init */
  for(i=0;i<sizeof(McuArmTools_UID);i++) {
    uid->id[i] = 0;
  }
  p = (uint8_t*)&FLASH_NMPA->UUID_ARRAY[0];
  for(i=0;i<sizeof(McuArmTools_UID) && i<sizeof(FLASH_NMPA->UUID_ARRAY);i++) {
    uid->id[i] = *p;
    p++;
  }
  return ERR_OK;
#elif McuLib_CONFIG_CPU_IS_LPC && McuLib_CONFIG_CPU_VARIANT==McuLib_CONFIG_CPU_VARIANT_NXP_LPC55S69
  int i;

  /* init */
  for(i=0;i<sizeof(McuArmTools_UID);i++) {
    uid->id[i] = 0;
  }
#if 0 /* should work for LPC55x59, but fails? */
  status_t status;
  flash_config_t flashConfig;

  status = FFR_Init(&flashConfig);
  if (status!=kStatus_Success) {
    return ERR_FAILED;
  }

  assert(sizeof(uid->id)*8>=128); /* must be at least 128 bits */
  status = FFR_GetUUID(&flashConfig, &uid->id[0]);
  if (status!=kStatus_Success) {
    return ERR_FAILED;
  }
#endif
  return ERR_FAILED; /* not implemented yet */
#else
  (void)uid; /* not used */
  return ERR_FAILED;
#endif
}

/*
** ===================================================================
**     Method      :  UIDSame (component KinetisTools)
**
**     Description :
**         Compares two UID
**     Parameters  :
**         NAME            - DESCRIPTION
**       * src             - Pointer to 
**         Variable_1      - 
**     Returns     :
**         ---             - TRUE if the same, FALSE otherwise
** ===================================================================
*/
/*!
 * \brief Compares two UID
 * \param src One UID
 * \param dst The other UID
 * \return TRUE if the two UID's are the same
 */
bool McuArmTools_UIDSame(const McuArmTools_UID *src, const McuArmTools_UID *dst)
{
  unsigned int i;

  for(i=0; i<sizeof(McuArmTools_UID); i++) {
    if (src->id[i]!=dst->id[i]) {
      return FALSE; /* no match */
    }
  }
  return TRUE;
}

/*
** ===================================================================
**     Method      :  UIDtoString (component KinetisTools)
**
**     Description :
**         Returns the value of the UID as string
**     Parameters  :
**         NAME            - DESCRIPTION
**         uid             - 
**       * buf             - Pointer to 
**         bufSize         - 
**     Returns     :
**         ---             - Error code
** ===================================================================
*/
/*!
 * \brief Transforms the 80bit UID into a string
 * \param id Pointer to the buffer where to store the string
 * \param bufSize Size of buffer in bytes
 * \return Error code, ERR_OK if everything is ok.
 */
uint8_t McuArmTools_UIDtoString(const McuArmTools_UID *uid, uint8_t *buf, size_t bufSize)
{
  unsigned int i;

  McuUtility_strcpy(buf, bufSize, (unsigned char*)"{");
  for(i=0;i<sizeof(McuArmTools_UID);i++) {
    McuUtility_strcat(buf, bufSize, (unsigned char*)"0x");
    McuUtility_strcatNum8Hex(buf, bufSize, uid->id[i]);
    if (i<sizeof(McuArmTools_UID)-1) {
      McuUtility_strcat(buf, bufSize, (unsigned char*)",");
    }
  }
  McuUtility_strcat(buf, bufSize, (unsigned char*)"}");
  return ERR_OK;
}

/*
** ===================================================================
**     Method      :  ParseCommand (component KinetisTools)
**
**     Description :
**         Shell Command Line parser. Method is only available if Shell
**         is enabled in the component properties.
**     Parameters  :
**         NAME            - DESCRIPTION
**         cmd             - Pointer to command string
**       * handled         - Pointer to variable which tells if
**                           the command has been handled or not
**       * io              - Pointer to I/O structure
**     Returns     :
**         ---             - Error code
** ===================================================================
*/
#if McuArmTools_CONFIG_PARSE_COMMAND_ENABLED
uint8_t McuArmTools_ParseCommand(const unsigned char* cmd, bool *handled, const McuShell_StdIOType *io)
{
  uint8_t res = ERR_OK;

  if (McuUtility_strcmp((char*)cmd, McuShell_CMD_HELP) == 0
    || McuUtility_strcmp((char*)cmd, "McuArmTools help") == 0) {
    *handled = TRUE;
    return PrintHelp(io);
  } else if (   (McuUtility_strcmp((char*)cmd, McuShell_CMD_STATUS)==0)
             || (McuUtility_strcmp((char*)cmd, "McuArmTools status") == 0)
            )
  {
    *handled = TRUE;
    res = PrintStatus(io);
  } else if (McuUtility_strcmp((char*)cmd, "McuArmTools reset") == 0) {
    *handled = TRUE;
    McuArmTools_SoftwareReset(); /* will perform RESET and does NOT return here! */
  }
  return res;
}
#endif

/*
** ===================================================================
**     Method      :  GetKinetisFamilyString (component KinetisTools)
**
**     Description :
**         Determines the Kinetis Familiy based on SIM_SDID register
**     Parameters  : None
**     Returns     :
**         ---             - String describing the Kinetis Family
** ===================================================================
*/
McuArmTools_ConstCharPtr McuArmTools_GetKinetisFamilyString(void)
{
#if McuLib_CONFIG_CPU_IS_KINETIS
  #if McuLib_CONFIG_CORTEX_M==0
  #ifdef SIM_SDID /* normal Kinetis define this */
    int32_t val;

    val = (SIM_SDID>>28)&0x3; /* bits 30..28 */
    if (val>=0 && val<=(int32_t)(sizeof(KinetisM0FamilyStrings)/sizeof(KinetisM0FamilyStrings[0]))) {
      return KinetisM0FamilyStrings[val];
    } else {
      return (McuArmTools_ConstCharPtr)"M0 Family ID out of bounds!";
    }
  #elif defined(SIM_SRSID_FAMID) /* MKE02Z4 defines this, hopefully all other KE too... */
    return (McuArmTools_ConstCharPtr)"KE0x Family"; /* 0000 only KE0x supported */
  #elif defined(SIM_SDID_FAMID) || defined(SIM_SDID_FAMILYID)
    int32_t val;

    val = ((SIM->SDID)>>28)&0xF; /* bits 31..28 */
    if (val>=0 && val<=(int32_t)(sizeof(KinetisM0FamilyStrings)/sizeof(KinetisM0FamilyStrings[0]))) {
      return KinetisM0FamilyStrings[val];
    } else {
      return (McuArmTools_ConstCharPtr)"M0 Family ID out of bounds!";
    }
  #else
    #error "Unknown architecture!"
    return (McuArmTools_ConstCharPtr)"ERROR";
  #endif
  #elif McuLib_CONFIG_CORTEX_M==4
    #ifdef SIM_SDID /* normal Kinetis define this */
    int32_t val;

    val = (SIM_SDID>>4)&0x3; /* bits 6..4 */
    if (val>=0 && val<=(int32_t)(sizeof(KinetisM4FamilyStrings)/sizeof(KinetisM4FamilyStrings[0]))) {
      return KinetisM4FamilyStrings[val];
    } else {
      return (McuArmTools_ConstCharPtr)"M4 Family ID out of bounds!";
    }
    #elif defined(SIM_SDID_FAMID) || defined(SIM_SDID_FAMILYID)
    int32_t val;

